# Pandas

---

## Series

In [1]:
import numpy as np
import pandas as pd

In [4]:
ser1=pd.Series(data=['venkat','brahma','reddy'],index=['dm','ds','java'])
ser1

dm      venkat
ds      brahma
java     reddy
dtype: object

In [6]:
ser2=pd.Series(data=['venkat','brahma','reddy'],index=['dm','ds','c'])
ser2

dm    venkat
ds    brahma
c      reddy
dtype: object

In [7]:
ser1+ser2                    # NaN means not a number

c                NaN
dm      venkatvenkat
ds      brahmabrahma
java             NaN
dtype: object

In [8]:
ser3=pd.Series(['a','b','c'])            # autoatic to take an index
ser3

0    a
1    b
2    c
dtype: object

In [10]:
ser1['dm']

'venkat'

In [17]:
la=['a','b','c']
lis=[1,2,3]
pd.Series(la,lis)

1    a
2    b
3    c
dtype: object

In [18]:
pd.Series(data=la,index=lis)

1    a
2    b
3    c
dtype: object

In [14]:
dic={'a':10,'b':20,'c':30}
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [22]:
pd.Series(dic,lis)

1   NaN
2   NaN
3   NaN
dtype: float64

In [24]:
pd.Series()           #empty series

Series([], dtype: float64)

## Scalar and Fexible values

##### --> The value is represented to match the length of index

In [25]:
s1=pd.Series(5,index=[1,2,3,4])
s1

1    5
2    5
3    5
4    5
dtype: int64

In [38]:
pd.Series('data science',index=[0,1,2,3,4])

0    data science
1    data science
2    data science
3    data science
4    data science
dtype: object

## Data Frame

In [2]:
from numpy.random import randn

In [3]:
a=randn(5,4)

In [4]:
np.random.seed(3)

In [5]:
df1=pd.DataFrame(a)
df1

          0         1         2         3
0  2.026083 -0.926541 -0.546180  1.427893
1 -0.744084 -0.380074  0.284244 -1.180719
2  0.961667  1.315981 -0.979013  1.097149
3 -0.195040 -1.835479 -0.375710 -0.663266
4 -0.089839  1.903936  2.089068 -0.477419

In [7]:
df1=pd.DataFrame(a,['x','y','z','m','n'],[2016,2017,2018,2019])
df1

       2016      2017      2018      2019
x  2.026083 -0.926541 -0.546180  1.427893
y -0.744084 -0.380074  0.284244 -1.180719
z  0.961667  1.315981 -0.979013  1.097149
m -0.195040 -1.835479 -0.375710 -0.663266
n -0.089839  1.903936  2.089068 -0.477419

In [30]:
#df2=pd.DataFrame(a,'abcde'.split(),[2018,2019,2020,2021])

In [33]:
df1[2016]

x   -3.484966
y    0.332929
z   -0.088907
m    0.046223
n   -1.512906
Name: 2016, dtype: float64

In [36]:
df1[[2016,2018]]

       2016      2018
x -3.484966  0.933873
y  0.332929  0.692153
z -0.088907 -1.843237
m  0.046223 -0.701034
n -1.512906 -0.662631

In [39]:
df1[:'x']

       2016      2017      2018      2019
x -3.484966 -0.955184  0.933873  0.551367

In [57]:
df1['sum']=df1[2016]+df1[2017]+df1[2018]+df1[2019]
df1['sum']

x   -2.954910
y    0.905489
z   -2.549982
m   -1.906226
n   -5.698854
dtype: float64

In [59]:
pd.DataFrame(df1['sum'])

        sum
x -2.954910
y  0.905489
z -2.549982
m -1.906226
n -5.698854

In [61]:
df1.drop('sum',axis=1)

      2016      2017      2018      2019      8070      16140
x -3.484966 -0.955184  0.933873  0.551367 -2.954910 -2.954910
y  0.332929  0.762469  0.692153 -0.882061  0.905489  0.905489
z -0.088907 -1.820245 -1.843237  1.202407 -2.549982 -2.549982
m  0.046223 -1.594203 -0.701034  0.342789 -1.906226 -1.906226
n -1.512906 -0.955311 -0.662631 -2.568006 -5.698854 -5.698854

In [62]:
df1

       2016      2017      2018      2019      8070     16140       sum
x -3.484966 -0.955184  0.933873  0.551367 -2.954910 -2.954910 -2.954910
y  0.332929  0.762469  0.692153 -0.882061  0.905489  0.905489  0.905489
z -0.088907 -1.820245 -1.843237  1.202407 -2.549982 -2.549982 -2.549982
m  0.046223 -1.594203 -0.701034  0.342789 -1.906226 -1.906226 -1.906226
n -1.512906 -0.955311 -0.662631 -2.568006 -5.698854 -5.698854 -5.698854

In [68]:
df1.drop('sum',axis=1,inplace=True)

In [8]:
df1

       2016      2017      2018      2019
x  2.026083 -0.926541 -0.546180  1.427893
y -0.744084 -0.380074  0.284244 -1.180719
z  0.961667  1.315981 -0.979013  1.097149
m -0.195040 -1.835479 -0.375710 -0.663266
n -0.089839  1.903936  2.089068 -0.477419

In [9]:
df1.drop('n')          # deleted in n row

       2016      2017      2018      2019
x  2.026083 -0.926541 -0.546180  1.427893
y -0.744084 -0.380074  0.284244 -1.180719
z  0.961667  1.315981 -0.979013  1.097149
m -0.195040 -1.835479 -0.375710 -0.663266

In [22]:
#df1.drop('n',axis=0,inplace=True)

In [19]:
df1

       2016      2017      2018      2019
x  2.026083 -0.926541 -0.546180  1.427893
y -0.744084 -0.380074  0.284244 -1.180719
z  0.961667  1.315981 -0.979013  1.097149
m -0.195040 -1.835479 -0.375710 -0.663266

In [23]:
df1.loc['x']

2016    2.026083
2017   -0.926541
2018   -0.546180
2019    1.427893
Name: x, dtype: float64

In [26]:
df1.iloc[0]            # i means index

2016    2.026083
2017   -0.926541
2018   -0.546180
2019    1.427893
Name: x, dtype: float64

In [27]:
df1.loc['x',2018]

-0.5461801146591007

In [28]:
df1.loc[['x','y'],[2018,2019]]

       2018      2019
x -0.546180  1.427893
y  0.284244 -1.180719

## dataframe conditions

In [31]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [33]:
a=randn(5,4)

In [45]:
df=pd.DataFrame(a,['a','b','c','d','e'],[2018,2019,2020,2021])
df

       2018      2019      2020      2021
a -1.185047 -0.205650  1.486148  0.236716
b -1.023785 -0.712993  0.625245 -0.160513
c -0.768836 -0.230031  0.745056  1.976111
d -1.244123 -0.626417 -0.803766 -2.419083
e -0.923792 -1.023876  1.123978 -0.131914

In [50]:
b=df>0
b

    2018   2019   2020   2021
a  False  False   True   True
b  False  False   True  False
c  False  False   True   True
d  False  False  False  False
e  False  False   True  False

In [51]:
df[b]

   2018  2019      2020      2021
a   NaN   NaN  1.486148  0.236716
b   NaN   NaN  0.625245       NaN
c   NaN   NaN  0.745056  1.976111
d   NaN   NaN       NaN       NaN
e   NaN   NaN  1.123978       NaN

In [52]:
df[df>0]

   2018  2019      2020      2021
a   NaN   NaN  1.486148  0.236716
b   NaN   NaN  0.625245       NaN
c   NaN   NaN  0.745056  1.976111
d   NaN   NaN       NaN       NaN
e   NaN   NaN  1.123978       NaN

In [53]:
df[df<0]

       2018      2019      2020      2021
a -1.185047 -0.205650       NaN       NaN
b -1.023785 -0.712993       NaN -0.160513
c -0.768836 -0.230031       NaN       NaN
d -1.244123 -0.626417 -0.803766 -2.419083
e -0.923792 -1.023876       NaN -0.131914